# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LeaderArray..::..Append Method
LeaderArray Class See Also
---
Add the item to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	Leader item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As Leader _
)
```

Visual C++
---
```text
public:
virtual void Append(
	Leader^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..LeaderThe item to be added.
# See Also
LeaderArray Class
Autodesk.Revit.DB Namespace